<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
	
	<meta http-equiv="content-type" content="text/html; charset=windows-1252"/>
	<title></title>
	<meta name="generator" content="LibreOffice 6.0.6.2 (Windows)"/>
	<meta name="created" content="00:00:00"/>
	<meta name="changed" content="2018-08-03T14:48:39.281000000"/>
	
	<style type="text/css">
		body,div,table,thead,tbody,tfoot,tr,th,td,p { font-family:"Arial"; font-size:x-small }
		a.comment-indicator:hover + comment { background:#ffd; position:absolute; display:block; border:1px solid black; padding:0.5em;  } 
		a.comment-indicator { background:red; display:inline-block; border:1px solid black; width:0.5em; height:0.5em;  } 
		comment { display:none;  } 
	</style>
	
</head>

<body>
<table cellspacing="0" border="0">
	<colgroup span="4" width="323"></colgroup>
	<colgroup width="67"></colgroup>
	<tr>
		<td height="20" align="left" valign=top>Declaraci&oacute;n Universal de Derechos Humanos</td>
		<td align="left" valign=top>Universal Declaration of Human Rights</td>
		<td align="left" valign=top>D&eacute;claration universelle des droits de l'homme</td>
		<td align="left" valign=top>Declara&ccedil;&atilde;o Universal dos Direitos Humanos</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Adoptada y proclamada por la Asamblea General en su resoluci&oacute;n 217 A (III), de 10 de diciembre de 1948</td>
		<td align="left" valign=top><br></td>
		<td align="left" valign=top><br></td>
		<td align="left" valign=top><br></td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Pre&aacute;mbulo</td>
		<td align="left" valign=top>Preamble</td>
		<td align="left" valign=top>Pr&eacute;ambule</td>
		<td align="left" valign=top>Pre&acirc;mbulo</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="79" align="left" valign=top>Considerando que la libertad, la justicia y la paz en el mundo tienen por base el reconocimiento de la dignidad intr&iacute;nseca y de los derechos iguales e inalienables de todos los miembros de la familia humana,</td>
		<td align="left" valign=top>Whereas recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world,</td>
		<td align="left" valign=top>Consid&eacute;rant que la reconnaissance de la dignit&eacute; inh&eacute;rente &agrave; tous les membres de la famille humaine et de leurs droits &eacute;gaux et inali&eacute;nables constitue le fondement de la libert&eacute;, de la justice et de la paix dans le monde,</td>
		<td align="left" valign=top>Considerando que o reconhecimento da dignidade inerente a todos os membros da fam&iacute;lia humana e dos seus direitos iguais e inalien&aacute;veis constitui o fundamento da liberdade, da justi&ccedil;a e da paz no mundo;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="124" align="left" valign=top>Considerando que el desconocimiento y el menosprecio de los derechos humanos han originado actos de barbarie ultrajantes para la conciencia de la humanidad; y que se ha proclamado, como la aspiraci&oacute;n m&aacute;s elevada del hombre, el advenimiento de un mundo en que los seres humanos, liberados del temor y de la miseria, disfruten de la libertad de palabra y de la libertad de creencias,</td>
		<td align="left" valign=top>Whereas disregard and contempt for human rights have resulted in barbarous acts which have outraged the conscience of mankind, and the advent of a world in which human beings shall enjoy freedom of speech and belief and freedom from fear and want has been proclaimed as the highest aspiration of the common people,</td>
		<td align="left" valign=top>Consid&eacute;rant que la m&eacute;connaissance et le m&eacute;pris des droits de l'homme ont conduit &agrave; des actes de barbarie qui r&eacute;voltent la conscience de l'humanit&eacute; et que l'av&egrave;nement d'un monde o&ugrave; les &ecirc;tres humains seront libres de parler et de croire, lib&eacute;r&eacute;s de la terreur et de la mis&egrave;re, a &eacute;t&eacute; proclam&eacute; comme la plus haute aspiration de l'homme,</td>
		<td align="left" valign=top>Considerando que o desconhecimento e o desprezo dos direitos do Homem conduziram a actos de barb&aacute;rie que revoltam a consci&ecirc;ncia da Humanidade e que o advento de um mundo em que os seres humanos sejam livres de falar e de crer, libertos do terror e da mis&eacute;ria, foi proclamado como a mais alta inspira&ccedil;&atilde;o do Homem;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="79" align="left" valign=top>Considerando esencial que los derechos humanos sean protegidos por un r&eacute;gimen de Derecho, a fin de que el hombre no se vea compelido al supremo recurso de la rebeli&oacute;n contra la tiran&iacute;a y la opresi&oacute;n,</td>
		<td align="left" valign=top>Whereas it is essential, if man is not to be compelled to have recourse, as a last resort, to rebellion against tyranny and oppression, that human rights should be protected by the rule of law,</td>
		<td align="left" valign=top>Consid&eacute;rant qu'il est essentiel que les droits de l'homme soient prot&eacute;g&eacute;s par un r&eacute;gime de droit pour que l'homme ne soit pas contraint, en supr&ecirc;me recours, &agrave; la r&eacute;volte contre la tyrannie et l'oppression,</td>
		<td align="left" valign=top>Considerando que &eacute; essencial a prote&ccedil;&atilde;o dos direitos do Homem atrav&eacute;s de um regime de direito, para que o Homem n&atilde;o seja compelido, em supremo recurso, &agrave; revolta contra a tirania e a opress&atilde;o;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Considerando tambi&eacute;n esencial promover el desarrollo de relaciones amistosas entre las naciones,</td>
		<td align="left" valign=top>Whereas it is essential to promote the development of friendly relations between nations,</td>
		<td align="left" valign=top>Consid&eacute;rant qu'il est essentiel d'encourager le d&eacute;veloppement de relations amicales entre nations,</td>
		<td align="left" valign=top>Considerando que &eacute; essencial encorajar o desenvolvimento de rela&ccedil;&otilde;es amistosas entre as na&ccedil;&otilde;es;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="124" align="left" valign=top>Considerando que los pueblos de las Naciones Unidas han reafirmado en la Carta su fe en los derechos fundamentales del hombre, en la dignidad y el valor de la persona humana y en la igualdad de derechos de hombres y mujeres; y se han declarado resueltos a promover el progreso social y a elevar el nivel de vida dentro de un concepto m&aacute;s amplio de la libertad,</td>
		<td align="left" valign=top>Whereas the peoples of the United Nations have in the Charter reaffirmed their faith in fundamental human rights, in the dignity and worth of the human person and in the equal rights of men and women and have determined to promote social progress and better standards of life in larger freedom,</td>
		<td align="left" valign=top>Consid&eacute;rant que dans la Charte les peuples des Nations Unies ont proclam&eacute; &agrave; nouveau leur foi dans les droits fondamentaux de l'homme, dans la dignit&eacute; et la valeur de la personne humaine, dans l'&eacute;galit&eacute; des droits des hommes et des femmes, et qu'ils se sont d&eacute;clar&eacute;s r&eacute;solus &agrave; favoriser le progr&egrave;s social et &agrave; instaurer de meilleures conditions de vie dans une libert&eacute; plus grande,</td>
		<td align="left" valign=top>Considerando que, na Carta, os povos das Na&ccedil;&otilde;es Unidas proclamam, de novo, a sua f&eacute; nos direitos fundamentais do Homem, na dignidade e no valor da pessoa humana, na igualdade de direitos dos homens e das mulheres e se declaram resolvidos a favorecer o progresso social e a instaurar melhores condi&ccedil;&otilde;es de vida dentro de uma liberdade mais ampla;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="79" align="left" valign=top>Considerando que los Estados Miembros se han comprometido a asegurar, en cooperaci&oacute;n con la Organizaci&oacute;n de las Naciones Unidas, el respeto universal y efectivo a los derechos y libertades fundamentales del hombre, y</td>
		<td align="left" valign=top>Whereas Member States have pledged themselves to achieve, in cooperation with the United Nations, the promotion of universal respect for and observance of human rights and fundamental freedoms,</td>
		<td align="left" valign=top>Consid&eacute;rant que les Etats Membres se sont engag&eacute;s &agrave; assurer, en coop&eacute;ration avec l'Organisation des Nations Unies, le respect universel et effectif des droits de l'homme et des libert&eacute;s fondamentales,</td>
		<td align="left" valign=top>Considerando que os Estados membros se comprometeram a promover, em coopera&ccedil;&atilde;o com a Organiza&ccedil;&atilde;o das Na&ccedil;&otilde;es Unidas, o respeito universal e efectivo dos direitos do Homem e das liberdades fundamentais;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Considerando que una concepci&oacute;n com&uacute;n de estos derechos y libertades es de la mayor importancia para el pleno cumplimiento de dicho compromiso,</td>
		<td align="left" valign=top>Whereas a common understanding of these rights and freedoms is of the greatest importance for the full realization of this pledge, Now, therefore,</td>
		<td align="left" valign=top>Consid&eacute;rant qu'une conception commune de ces droits et libert&eacute;s est de la plus haute importance pour remplir pleinement cet engagement,</td>
		<td align="left" valign=top>Considerando que uma concep&ccedil;&atilde;o comum destes direitos e liberdades &eacute; da mais alta import&acirc;ncia para dar plena satisfa&ccedil;&atilde;o a tal compromisso:</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>La Asamblea General</td>
		<td align="left" valign=top>The General Assembly,</td>
		<td align="left" valign=top>L'Assembl&eacute;e g&eacute;n&eacute;rale</td>
		<td align="left" valign=top>A Assembl&eacute;ia Geral</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="199" align="left" valign=top>Proclama la presente Declaraci&oacute;n Universal de Derechos Humanos como ideal com&uacute;n por el que todos los pueblos y naciones deben esforzarse, a fin de que tanto los individuos como las instituciones, inspir&aacute;ndose constantemente en ella, promuevan, mediante la ense&ntilde;anza y la educaci&oacute;n, el respeto a estos derechos y libertades, y aseguren, por medidas progresivas de car&aacute;cter nacional e internacional, su reconocimiento y aplicaci&oacute;n universales y efectivos, tanto entre los pueblos de los Estados Miembros como entre los de los territorios colocados bajo su jurisdicci&oacute;n.</td>
		<td align="left" valign=top>Proclaims this Universal Declaration of Human Rights as a common standard of achievement for all peoples and all nations, to the end that every individual and every organ of society, keeping this Declaration constantly in mind, shall strive by teaching and education to promote respect for these rights and freedoms and by progressive measures, national and international, to secure their universal and effective recognition and observance, both among the peoples of Member States themselves and among the peoples of territories under their jurisdiction.</td>
		<td align="left" valign=top>Proclame la pr&eacute;sente D&eacute;claration universelle des droits de l'homme comme l'id&eacute;al commun &agrave; atteindre par tous les peuples et toutes les nations afin que tous les individus et tous les organes de la soci&eacute;t&eacute;, ayant cette D&eacute;claration constamment &agrave; l'esprit, s'efforcent, par l'enseignement et l'&eacute;ducation, de d&eacute;velopper le respect de ces droits et libert&eacute;s et d'en assurer, par des mesures progressives d'ordre national et international, la reconnaissance et l'application universelles et effectives, tant parmi les populations des Etats Membres eux-m&ecirc;mes que parmi celles des territoires plac&eacute;s sous leur juridiction.</td>
		<td align="left" valign=top>proclama a presente Declara&ccedil;&atilde;o Universal dos Direitos Humanos como ideal comum a atingir por todos os povos e todas as na&ccedil;&otilde;es, a fim de que todos os indiv&iacute;duos e todos os org&atilde;os da sociedade, tendo-a constantemente no esp&iacute;rito, se esforcem, pelo ensino e pela educa&ccedil;&atilde;o, por desenvolver o respeito desses direitos e liberdades e por promover, por medidas progressivas de ordem nacional e internacional, o seu reconhecimento e a sua aplica&ccedil;&atilde;o universais e efectivos tanto entre as popula&ccedil;&otilde;es dos pr&oacute;prios Estados membros como entre as dos territ&oacute;rios colocados sob a sua jurisdi&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 1</td>
		<td align="left" valign=top>Article 1</td>
		<td align="left" valign=top>Article premier</td>
		<td align="left" valign=top>Artigo 1&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Todos los seres humanos nacen libres e iguales en dignidad y derechos y, dotados como est&aacute;n de raz&oacute;n y conciencia, deben comportarse fraternalmente los unos con los otros.</td>
		<td align="left" valign=top>All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.</td>
		<td align="left" valign=top>Tous les &ecirc;tres humains naissent libres et &eacute;gaux en dignit&eacute; et en droits. Ils sont dou&eacute;s de raison et de conscience et doivent agir les uns envers les autres dans un esprit de fraternit&eacute;.</td>
		<td align="left" valign=top>Todos os seres humanos nascem livres e iguais em dignidade e em direitos. Dotados de raz&atilde;o e de consci&ecirc;ncia, devem agir uns para com os outros em esp&iacute;rito de fraternidade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 2</td>
		<td align="left" valign=top>Article 2</td>
		<td align="left" valign=top>Article 2</td>
		<td align="left" valign=top>Artigo 2&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="109" align="left" valign=top>Toda persona tiene los derechos y libertades proclamados en esta Declaraci&oacute;n, sin distinci&oacute;n alguna de raza, color, sexo, idioma, religi&oacute;n, opini&oacute;n pol&iacute;tica o de cualquier otra &iacute;ndole, origen nacional o social, posici&oacute;n econ&oacute;mica, nacimiento o cualquier otra condici&oacute;n.</td>
		<td align="left" valign=top>Everyone is entitled to all the rights and freedoms set forth in this Declaration, without distinction of any kind, such as race, colour, sex, language, religion, political or other opinion, national or social origin, property, birth or other status.</td>
		<td align="left" valign=top>Chacun peut se pr&eacute;valoir de tous les droits et de toutes les libert&eacute;s proclam&eacute;s dans la pr&eacute;sente D&eacute;claration, sans distinction aucune, notamment de race, de couleur, de sexe, de langue, de religion, d'opinion politique ou de toute autre opinion, d'origine nationale ou sociale, de fortune, de naissance ou de toute autre situation.</td>
		<td align="left" valign=top>Todos os seres humanos podem invocar os direitos e as liberdades proclamados na presente Declara&ccedil;&atilde;o, sem distin&ccedil;&atilde;o alguma, nomeadamente de ra&ccedil;a, de cor, de sexo, de l&iacute;ngua, de religi&atilde;o, de opini&atilde;o pol&iacute;tica ou outra, de origem nacional ou social, de fortuna, de nascimento ou de qualquer outra situa&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="109" align="left" valign=top>Adem&aacute;s, no se har&aacute; distinci&oacute;n alguna fundada en la condici&oacute;n pol&iacute;tica, jur&iacute;dica o internacional del pa&iacute;s o territorio de cuya jurisdicci&oacute;n dependa una persona, tanto si se trata de un pa&iacute;s independiente, como de un territorio bajo administraci&oacute;n fiduciaria, no aut&oacute;nomo o sometido a cualquier otra limitaci&oacute;n de soberan&iacute;a.</td>
		<td align="left" valign=top>Furthermore, no distinction shall be made on the basis of the political, jurisdictional or international status of the country or territory to which a person belongs, whether it be independent, trust, non-self-governing or under any other limitation of sovereignty.</td>
		<td align="left" valign=top>De plus, il ne sera fait aucune distinction fond&eacute;e sur le statut politique, juridique ou international du pays ou du territoire dont une personne est ressortissante, que ce pays ou territoire soit ind&eacute;pendant, sous tutelle, non autonome ou soumis &agrave; une limitation quelconque de souverainet&eacute;.</td>
		<td align="left" valign=top>Al&eacute;m disso, n&atilde;o ser&aacute; feita nenhuma distin&ccedil;&atilde;o fundada no estatuto pol&iacute;tico, jur&iacute;dico ou internacional do pa&iacute;s ou do territ&oacute;rio da naturalidade da pessoa, seja esse pa&iacute;s ou territ&oacute;rio independente, sob tutela, aut&ocirc;nomo ou sujeito a alguma limita&ccedil;&atilde;o de soberania.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 3</td>
		<td align="left" valign=top>Article 3</td>
		<td align="left" valign=top>Article 3</td>
		<td align="left" valign=top>Artigo 3&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Todo individuo tiene derecho a la vida, a la libertad y a la seguridad de su persona.</td>
		<td align="left" valign=top>Everyone has the right to life, liberty and security of person.</td>
		<td align="left" valign=top>Tout individu a droit &agrave; la vie, &agrave; la libert&eacute; et &agrave; la s&ucirc;ret&eacute; de sa personne.</td>
		<td align="left" valign=top>Todo indiv&iacute;duo tem direito &agrave; vida, &agrave; liberdade e &agrave; seguran&ccedil;a pessoal.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 4</td>
		<td align="left" valign=top>Article 4</td>
		<td align="left" valign=top>Article 4</td>
		<td align="left" valign=top>Artigo 4&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Nadie estar&aacute; sometido a esclavitud ni a servidumbre; la esclavitud y la trata de esclavos est&aacute;n prohibidas en todas sus formas.</td>
		<td align="left" valign=top>No one shall be held in slavery or servitude; slavery and the slave trade shall be prohibited in all their forms.</td>
		<td align="left" valign=top>Nul ne sera tenu en esclavage ni en servitude; l'esclavage et la traite des esclaves sont interdits sous toutes leurs formes.</td>
		<td align="left" valign=top>Ningu&eacute;m ser&aacute; mantido em escravatura ou em servid&atilde;o; a escravatura e o trato dos escravos, sob todas as formas, s&atilde;o proibidos.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 5</td>
		<td align="left" valign=top>Article 5</td>
		<td align="left" valign=top>Article 5</td>
		<td align="left" valign=top>Artigo 5&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Nadie ser&aacute; sometido a torturas ni a penas o tratos crueles, inhumanos o degradantes.</td>
		<td align="left" valign=top>No one shall be subjected to torture or to cruel, inhuman or degrading treatment or punishment.</td>
		<td align="left" valign=top>Nul ne sera soumis &agrave; la torture, ni &agrave; des peines ou traitements cruels, inhumains ou d&eacute;gradants.</td>
		<td align="left" valign=top>Ningu&eacute;m ser&aacute; submetido a tortura nem a penas ou tratamentos cru&eacute;is, desumanos ou degradantes.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 6</td>
		<td align="left" valign=top>Article 6</td>
		<td align="left" valign=top>Article 6</td>
		<td align="left" valign=top>Artigo 6&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Todo ser humano tiene derecho, en todas partes, al reconocimiento de su personalidad jur&iacute;dica.</td>
		<td align="left" valign=top>Everyone has the right to recognition everywhere as a person before the law.</td>
		<td align="left" valign=top>Chacun a le droit &agrave; la reconnaissance en tous lieux de sa personnalit&eacute; juridique.</td>
		<td align="left" valign=top>Todos os indiv&iacute;duos t&ecirc;m direito ao reconhecimento, em todos os lugares, da sua personalidade jur&iacute;dica.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 7</td>
		<td align="left" valign=top>Article 7</td>
		<td align="left" valign=top>Article 7</td>
		<td align="left" valign=top>Artigo 7&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Todos son iguales ante la ley y tienen, sin distinci&oacute;n, derecho a igual protecci&oacute;n de la ley.</td>
		<td align="left" valign=top>All are equal before the law and are entitled without any discrimination to equal protection of the law.</td>
		<td align="left" valign=top>Tous sont &eacute;gaux devant la loi et ont droit sans distinction &agrave; une &eacute;gale protection de la loi.</td>
		<td align="left" valign=top>Todos s&atilde;o iguais perante a lei e, sem distin&ccedil;&atilde;o, t&ecirc;m direito a igual protec&ccedil;&atilde;o da lei.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Todos tienen derecho a igual protecci&oacute;n contra toda discriminaci&oacute;n que infrinja esta Declaraci&oacute;n y contra toda provocaci&oacute;n a tal discriminaci&oacute;n.</td>
		<td align="left" valign=top>All are entitled to equal protection against any discrimination in violation of this Declaration and against any incitement to such discrimination.</td>
		<td align="left" valign=top>Tous ont droit &agrave; une protection &eacute;gale contre toute discrimination qui violerait la pr&eacute;sente D&eacute;claration et contre toute provocation &agrave; une telle discrimination.</td>
		<td align="left" valign=top>Todos t&ecirc;m direito a protec&ccedil;&atilde;o igual contra qualquer discrimina&ccedil;&atilde;o que viole a presente Declara&ccedil;&atilde;o e contra qualquer incitamento a tal discrimina&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 8</td>
		<td align="left" valign=top>Article 8</td>
		<td align="left" valign=top>Article 8</td>
		<td align="left" valign=top>Artigo 8&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="79" align="left" valign=top>Toda persona tiene derecho a un recurso efectivo, ante los tribunales nacionales competentes, que la ampare contra actos que violen sus derechos fundamentales reconocidos por la constituci&oacute;n o por la ley.</td>
		<td align="left" valign=top>Everyone has the right to an effective remedy by the competent national tribunals for acts violating the fundamental rights granted him by the constitution or by law.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; un recours effectif devant les juridictions nationales comp&eacute;tentes contre les actes violant les droits fondamentaux qui lui sont reconnus par la constitution ou par la loi.</td>
		<td align="left" valign=top>Toda a pessoa tem direito a recurso efectivo para as jurisdi&ccedil;&otilde;es nacionais competentes contra os actos que violem os direitos fundamentais reconhecidos pela Constitui&ccedil;&atilde;o ou pela lei.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 9</td>
		<td align="left" valign=top>Article 9</td>
		<td align="left" valign=top>Article 9</td>
		<td align="left" valign=top>Artigo 9&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Nadie podr&aacute; ser arbitrariamente detenido, preso ni desterrado.</td>
		<td align="left" valign=top>No one shall be subjected to arbitrary arrest, detention or exile.</td>
		<td align="left" valign=top>Nul ne peut &ecirc;tre arbitrairement arr&ecirc;t&eacute;, d&eacute;tenu ni exil&eacute;.</td>
		<td align="left" valign=top>Ningu&eacute;m pode ser arbitrariamente preso, detido ou exilado.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 10</td>
		<td align="left" valign=top>Article 10</td>
		<td align="left" valign=top>Article 10</td>
		<td align="left" valign=top>Artigo 10&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="94" align="left" valign=top>Toda persona tiene derecho, en condiciones de plena igualdad, a ser o&iacute;da p&uacute;blicamente y con justicia por un tribunal independiente e imparcial, para la determinaci&oacute;n de sus derechos y obligaciones o para el examen de cualquier acusaci&oacute;n contra ella en materia penal.</td>
		<td align="left" valign=top>Everyone is entitled in full equality to a fair and public hearing by an independent and impartial tribunal, in the determination of his rights and obligations and of any criminal charge against him.</td>
		<td align="left" valign=top>Toute personne a droit, en pleine &eacute;galit&eacute;, &agrave; ce que sa cause soit entendue &eacute;quitablement et publiquement par un tribunal ind&eacute;pendant et impartial, qui d&eacute;cidera, soit de ses droits et obligations, soit du bien-fond&eacute; de toute accusation en mati&egrave;re p&eacute;nale dirig&eacute;e contre elle.</td>
		<td align="left" valign=top>Toda a pessoa tem direito, em plena igualdade, a que a sua causa seja equitativa e publicamente julgada por um tribunal independente e imparcial que decida dos seus direitos e obriga&ccedil;&otilde;es ou das raz&otilde;es de qualquer acusa&ccedil;&atilde;o em mat&eacute;ria penal que contra ela seja deduzida.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 11</td>
		<td align="left" valign=top>Article 11</td>
		<td align="left" valign=top>Article 11</td>
		<td align="left" valign=top>Artigo 11&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="79" align="left" valign=top>Toda persona acusada de delito tiene derecho a que se presuma su inocencia mientras no se pruebe su culpabilidad, conforme a la ley y en juicio p&uacute;blico en el que se le hayan asegurado todas las garant&iacute;as necesarias para su defensa.</td>
		<td align="left" valign=top>Everyone charged with a penal offence has the right to be presumed innocent until proved guilty according to law in a public trial at which he has had all the guarantees necessary for his defence.</td>
		<td align="left" valign=top>Toute personne accus&eacute;e d'un acte d&eacute;lictueux est pr&eacute;sum&eacute;e innocente jusqu'&agrave; ce que sa culpabilit&eacute; ait &eacute;t&eacute; l&eacute;galement &eacute;tablie au cours d'un proc&egrave;s public o&ugrave; toutes les garanties n&eacute;cessaires &agrave; sa d&eacute;fense lui auront &eacute;t&eacute; assur&eacute;es.</td>
		<td align="left" valign=top>Toda a pessoa acusada de um acto delituoso presume-se inocente at&eacute; que a sua culpabilidade fique legalmente provada no decurso de um processo p&uacute;blico em que todas as garantias necess&aacute;rias de defesa lhe sejam asseguradas.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Nadie ser&aacute; condenado por actos u omisiones que en el momento de cometerse no fueron delictivos seg&uacute;n el Derecho nacional o internacional.</td>
		<td align="left" valign=top>No one shall be held guilty of any penal offence on account of any act or omission which did not constitute a penal offence, under national or international law, at the time when it was committed.</td>
		<td align="left" valign=top>Nul ne sera condamn&eacute; pour des actions ou omissions qui, au moment o&ugrave; elles ont &eacute;t&eacute; commises, ne constituaient pas un acte d&eacute;lictueux d'apr&egrave;s le droit national ou international.</td>
		<td align="left" valign=top>Ningu&eacute;m ser&aacute; condenado por ac&ccedil;&otilde;es ou omiss&otilde;es que, no momento da sua pr&aacute;tica, n&atilde;o constitu&iacute;am acto delituoso &agrave; face do direito interno ou internacional.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Tampoco se impondr&aacute; pena m&aacute;s grave que la aplicable en el momento de la comisi&oacute;n del delito.</td>
		<td align="left" valign=top>Nor shall a heavier penalty be imposed than the one that was applicable at the time the penal offence was committed.</td>
		<td align="left" valign=top>De m&ecirc;me, il ne sera inflig&eacute; aucune peine plus forte que celle qui &eacute;tait applicable au moment o&ugrave; l'acte d&eacute;lictueux a &eacute;t&eacute; commis.</td>
		<td align="left" valign=top>Do mesmo modo, n&atilde;o ser&aacute; infligida pena mais grave do que a que era aplic&aacute;vel no momento em que o acto delituoso foi cometido.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 12</td>
		<td align="left" valign=top>Article 12</td>
		<td align="left" valign=top>Article 12</td>
		<td align="left" valign=top>Artigo 12&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Nadie ser&aacute; objeto de injerencias arbitrarias en su vida privada, su familia, su domicilio o su correspondencia, ni de ataques a su honra o a su reputaci&oacute;n.</td>
		<td align="left" valign=top>No one shall be subjected to arbitrary interference with his privacy, family, home or correspondence, nor to attacks upon his honour and reputation.</td>
		<td align="left" valign=top>Nul ne sera l'objet d'immixtions arbitraires dans sa vie priv&eacute;e, sa famille, son domicile ou sa correspondance, ni d'atteintes &agrave; son honneur et &agrave; sa r&eacute;putation.</td>
		<td align="left" valign=top>Ningu&eacute;m sofrer&aacute; intromiss&otilde;es arbitr&aacute;rias na sua vida privada, na sua fam&iacute;lia, no seu domic&iacute;lio ou na sua correspond&ecirc;ncia, nem ataques &agrave; sua honra e reputa&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Toda persona tiene derecho a la protecci&oacute;n de la ley contra tales injerencias o ataques.</td>
		<td align="left" valign=top>Everyone has the right to the protection of the law against such interference or attacks.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; la protection de la loi contre de telles immixtions ou de telles atteintes.</td>
		<td align="left" valign=top>Contra tais intromiss&otilde;es ou ataques toda a pessoa tem direito a protec&ccedil;&atilde;o da lei.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 13</td>
		<td align="left" valign=top>Article 13</td>
		<td align="left" valign=top>Article 13</td>
		<td align="left" valign=top>Artigo 13&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Toda persona tiene derecho a circular libremente y a elegir su residencia en el territorio de un Estado.</td>
		<td align="left" valign=top>Everyone has the right to freedom of movement and residence within the borders of each State.</td>
		<td align="left" valign=top>Toute personne a le droit de circuler librement et de choisir sa r&eacute;sidence &agrave; l'int&eacute;rieur d'un Etat.</td>
		<td align="left" valign=top>Toda a pessoa tem o direito de livremente circular e escolher a sua resid&ecirc;ncia no interior de um Estado.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Toda persona tiene derecho a salir de cualquier pa&iacute;s, incluso el propio, y a regresar a su pa&iacute;s.</td>
		<td align="left" valign=top>Everyone has the right to leave any country, including his own, and to return to his country.</td>
		<td align="left" valign=top>Toute personne a le droit de quitter tout pays, y compris le sien, et de revenir dans son pays.</td>
		<td align="left" valign=top>Toda a pessoa tem o direito de abandonar o pa&iacute;s em que se encontra, incluindo o seu, e o direito de regressar ao seu pa&iacute;s.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 14</td>
		<td align="left" valign=top>Article 14</td>
		<td align="left" valign=top>Article 14</td>
		<td align="left" valign=top>Artigo 14&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>En caso de persecuci&oacute;n, toda persona tiene derecho a buscar asilo, y a disfrutar de &eacute;l, en cualquier pa&iacute;s.</td>
		<td align="left" valign=top>Everyone has the right to seek and to enjoy in other countries asylum from persecution.</td>
		<td align="left" valign=top>Devant la pers&eacute;cution, toute personne a le droit de chercher asile et de b&eacute;n&eacute;ficier de l'asile en d'autres pays.</td>
		<td align="left" valign=top>Toda a pessoa sujeita a persegui&ccedil;&atilde;o tem o direito de procurar e de beneficiar de asilo em outros pa&iacute;ses.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Este derecho no podr&aacute; ser invocado contra una acci&oacute;n judicial realmente originada por delitos comunes o por actos opuestos a los prop&oacute;sitos y principios de las Naciones Unidas.</td>
		<td align="left" valign=top>This right may not be invoked in the case of prosecutions genuinely arising from non-political crimes or from acts contrary to the purposes and principles of the United Nations.</td>
		<td align="left" valign=top>Ce droit ne peut &ecirc;tre invoqu&eacute; dans le cas de poursuites r&eacute;ellement fond&eacute;es sur un crime de droit commun ou sur des agissements contraires aux buts et aux principes des Nations Unies.</td>
		<td align="left" valign=top>Este direito n&atilde;o pode, por&eacute;m, ser invocado no caso de processo realmente existente por crime de direito comum ou por actividades contr&aacute;rias aos fins e aos princ&iacute;pios das Na&ccedil;&otilde;es Unidas.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 15</td>
		<td align="left" valign=top>Article 15</td>
		<td align="left" valign=top>Article 15</td>
		<td align="left" valign=top>Artigo 15&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Toda persona tiene derecho a una nacionalidad.</td>
		<td align="left" valign=top>Everyone has the right to a nationality.</td>
		<td align="left" valign=top>Tout individu a droit &agrave; une nationalit&eacute;.</td>
		<td align="left" valign=top>Todo o indiv&iacute;duo tem direito a ter uma nacionalidade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>A nadie se privar&aacute; arbitrariamente de su nacionalidad ni del derecho a cambiar de nacionalidad.</td>
		<td align="left" valign=top>No one shall be arbitrarily deprived of his nationality nor denied the right to change his nationality.</td>
		<td align="left" valign=top>Nul ne peut &ecirc;tre arbitrairement priv&eacute; de sa nationalit&eacute;, ni du droit de changer de nationalit&eacute;.</td>
		<td align="left" valign=top>Ningu&eacute;m pode ser arbitrariamente privado da sua nacionalidade nem do direito de mudar de nacionalidade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 16</td>
		<td align="left" valign=top>Article 16</td>
		<td align="left" valign=top>Article 16</td>
		<td align="left" valign=top>Artigo 16&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="94" align="left" valign=top>Los hombres y las mujeres, a partir de la edad n&uacute;bil, tienen derecho, sin restricci&oacute;n alguna por motivos de raza, nacionalidad o religi&oacute;n, a casarse y fundar una familia; y disfrutar&aacute;n de iguales derechos en cuanto al matrimonio, durante el matrimonio y en caso de disoluci&oacute;n del matrimonio.</td>
		<td align="left" valign=top>Men and women of full age, without any limitation due to race, nationality or religion, have the right to marry and to found a family. They are entitled to equal rights as to marriage, during marriage and at its dissolution.</td>
		<td align="left" valign=top>A partir de l'&acirc;ge nubile, l'homme et la femme, sans aucune restriction quant &agrave; la race, la nationalit&eacute; ou la religion, ont le droit de se marier et de fonder une famille.</td>
		<td align="left" valign=top>A partir da idade n&uacute;bil, o homem e a mulher t&ecirc;m o direito de casar e de constituir fam&iacute;lia, sem restri&ccedil;&atilde;o alguma de ra&ccedil;a, nacionalidade ou religi&atilde;o. Durante o casamento e na altura da sua dissolu&ccedil;&atilde;o, ambos t&ecirc;m direitos iguais.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>S&oacute;lo mediante libre y pleno consentimiento de los futuros esposos podr&aacute; contraerse el matrimonio.</td>
		<td align="left" valign=top>Marriage shall be entered into only with the free and full consent of the intending spouses.</td>
		<td align="left" valign=top>Ils ont des droits &eacute;gaux au regard du mariage, durant le mariage et lors de sa dissolution. Le mariage ne peut &ecirc;tre conclu qu'avec le libre et plein consentement des futurs &eacute;poux.</td>
		<td align="left" valign=top>O casamento n&atilde;o pode ser celebrado sem o livre e pleno consentimento dos futuros esposos.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>La familia es el elemento natural y fundamental de la sociedad y tiene derecho a la protecci&oacute;n de la sociedad y del Estado.</td>
		<td align="left" valign=top>The family is the natural and fundamental group unit of society and is entitled to protection by society and the State.</td>
		<td align="left" valign=top>La famille est l'&eacute;l&eacute;ment naturel et fondamental de la soci&eacute;t&eacute; et a droit &agrave; la protection de la soci&eacute;t&eacute; et de l'Etat.</td>
		<td align="left" valign=top>A fam&iacute;lia &eacute; o elemento natural e fundamental da sociedade e tem direito &agrave; prote&ccedil;&atilde;o desta e do Estado.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 17</td>
		<td align="left" valign=top>Article 17</td>
		<td align="left" valign=top>Article 17</td>
		<td align="left" valign=top>Artigo 17&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Toda persona tiene derecho a la propiedad, individual y colectivamente.</td>
		<td align="left" valign=top>Everyone has the right to own property alone as well as in association with others.</td>
		<td align="left" valign=top>Toute personne, aussi bien seule qu'en collectivit&eacute;, a droit &agrave; la propri&eacute;t&eacute;.</td>
		<td align="left" valign=top>Toda a pessoa, individual ou colectiva, tem direito &agrave; propriedade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Nadie ser&aacute; privado arbitrariamente de su propiedad.</td>
		<td align="left" valign=top>No one shall be arbitrarily deprived of his property.</td>
		<td align="left" valign=top>Nul ne peut &ecirc;tre arbitrairement priv&eacute; de sa propri&eacute;t&eacute;</td>
		<td align="left" valign=top>Ningu&eacute;m pode ser arbitrariamente privado da sua propriedade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 18</td>
		<td align="left" valign=top>Article 18</td>
		<td align="left" valign=top>Article 18</td>
		<td align="left" valign=top>Artigo 18&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="109" align="left" valign=top>Toda persona tiene derecho a la libertad de pensamiento, de conciencia y de religi&oacute;n; este derecho incluye la libertad de cambiar de religi&oacute;n o de creencia, as&iacute; como la libertad de manifestar su religi&oacute;n o su creencia, individual y colectivamente, tanto en p&uacute;blico como en privado, por la ense&ntilde;anza, la pr&aacute;ctica, el culto y la observancia.</td>
		<td align="left" valign=top>Everyone has the right to freedom of thought, conscience and religion; this right includes freedom to change his religion or belief, and freedom, either alone or in community with others and in public or private, to manifest his religion or belief in teaching, practice, worship and observance.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; la libert&eacute; de pens&eacute;e, de conscience et de religion; ce droit implique la libert&eacute; de changer de religion ou de conviction ainsi que la libert&eacute; de manifester sa religion ou sa conviction, seule ou en commun, tant en public qu'en priv&eacute;, par l'enseignement, les pratiques, le culte et l'accomplissement des rites.</td>
		<td align="left" valign=top>Toda a pessoa tem direito &agrave; liberdade de pensamento, de consci&ecirc;ncia e de religi&atilde;o; este direito implica a liberdade de mudar de religi&atilde;o ou de convic&ccedil;&atilde;o, assim como a liberdade de manifestar a religi&atilde;o ou convic&ccedil;&atilde;o, sozinho ou em comum, tanto em p&uacute;blico como em privado, pelo ensino, pela pr&aacute;tica, pelo culto e pelos ritos.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 19</td>
		<td align="left" valign=top>Article 19</td>
		<td align="left" valign=top>Article 19</td>
		<td align="left" valign=top>Artigo 19&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="94" align="left" valign=top>Todo individuo tiene derecho a la libertad de opini&oacute;n y de expresi&oacute;n; este derecho incluye el no ser molestado a causa de sus opiniones, el de investigar y recibir informaciones y opiniones, y el de difundirlas, sin limitaci&oacute;n de fronteras, por cualquier medio de expresi&oacute;n.</td>
		<td align="left" valign=top>Everyone has the right to freedom of opinion and expression; this right includes freedom to hold opinions without interference and to seek, receive and impart information and ideas through any media and regardless of frontiers.</td>
		<td align="left" valign=top>Tout individu a droit &agrave; la libert&eacute; d'opinion et d'expression, ce qui implique le droit de ne pas &ecirc;tre inqui&eacute;t&eacute; pour ses opinions et celui de chercher, de recevoir et de r&eacute;pandre, sans consid&eacute;rations de fronti&egrave;res, les informations et les id&eacute;es par quelque moyen d'expression que ce soit.</td>
		<td align="left" valign=top>Todo o indiv&iacute;duo tem direito &agrave; liberdade de opini&atilde;o e de express&atilde;o, o que implica o direito de n&atilde;o ser inquietado pelas suas opini&otilde;es e o de procurar, receber e difundir, sem considera&ccedil;&atilde;o de fronteiras, informa&ccedil;&otilde;es e id&eacute;ias por qualquer meio de express&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 20</td>
		<td align="left" valign=top>Article 20</td>
		<td align="left" valign=top>Article 20</td>
		<td align="left" valign=top>Artigo 20&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Toda persona tiene derecho a la libertad de reuni&oacute;n y de asociaci&oacute;n pac&iacute;ficas.</td>
		<td align="left" valign=top>Everyone has the right to freedom of peaceful assembly and association.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; la libert&eacute; de r&eacute;union et d'association pacifiques.</td>
		<td align="left" valign=top>Toda a pessoa tem direito &agrave; liberdade de reuni&atilde;o e de associa&ccedil;&atilde;o pac&iacute;ficas.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Nadie podr&aacute; ser obligado a pertenecer a una asociaci&oacute;n.</td>
		<td align="left" valign=top>No one may be compelled to belong to an association.</td>
		<td align="left" valign=top>Nul ne peut &ecirc;tre oblig&eacute; de faire partie d'une association.</td>
		<td align="left" valign=top>Ningu&eacute;m pode ser obrigado a fazer parte de uma associa&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 21</td>
		<td align="left" valign=top>Article 21</td>
		<td align="left" valign=top>Article 21</td>
		<td align="left" valign=top>Artigo 21&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Toda persona tiene derecho a participar en el gobierno de su pa&iacute;s, directamente o por medio de representantes libremente escogidos.</td>
		<td align="left" valign=top>Everyone has the right to take part in the government of his country, directly or through freely chosen representatives.</td>
		<td align="left" valign=top>Toute personne a le droit de prendre part &agrave; la direction des affaires publiques de son pays, soit directement, soit par l'interm&eacute;diaire de repr&eacute;sentants librement choisis.</td>
		<td align="left" valign=top>Toda a pessoa tem o direito de tomar parte na direc&ccedil;&atilde;o dos neg&oacute;cios, p&uacute;blicos do seu pa&iacute;s, quer directamente, quer por interm&eacute;dio de representantes livremente escolhidos.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Toda persona tiene el derecho de acceso, en condiciones de igualdad, a las funciones p&uacute;blicas de su pa&iacute;s.</td>
		<td align="left" valign=top>Everyone has the right to equal access to public service in his country.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; acc&eacute;der, dans des conditions d'&eacute;galit&eacute;, aux fonctions publiques de son pays.</td>
		<td align="left" valign=top>Toda a pessoa tem direito de acesso, em condi&ccedil;&otilde;es de igualdade, &agrave;s fun&ccedil;&otilde;es p&uacute;blicas do seu pa&iacute;s.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="94" align="left" valign=top>La voluntad del pueblo es la base de la autoridad del poder p&uacute;blico; esta voluntad se expresar&aacute; mediante elecciones aut&eacute;nticas que habr&aacute;n de celebrarse peri&oacute;dicamente, por sufragio universal e igual y por voto secreto u otro procedimiento equivalente que garantice la libertad del voto.</td>
		<td align="left" valign=top>The will of the people shall be the basis of the authority of government; this will shall be expressed in periodic and genuine elections which shall be by universal and equal suffrage and shall be held by secret vote or by equivalent free voting procedures.</td>
		<td align="left" valign=top>La volont&eacute; du peuple est le fondement de l'autorit&eacute; des pouvoirs publics; cette volont&eacute; doit s'exprimer par des &eacute;lections honn&ecirc;tes qui doivent avoir lieu p&eacute;riodiquement, au suffrage universel &eacute;gal et au vote secret ou suivant une proc&eacute;dure &eacute;quivalente assurant la libert&eacute; du vote.</td>
		<td align="left" valign=top>A vontade do povo &eacute; o fundamento da autoridade dos poderes p&uacute;blicos: e deve exprimir-se atrav&eacute;s de elei&ccedil;&otilde;es honestas a realizar periodicamente por sufr&aacute;gio universal e igual, com voto secreto ou segundo processo equivalente que salvaguarde a liberdade de voto.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 22</td>
		<td align="left" valign=top>Article 22</td>
		<td align="left" valign=top>Article 22</td>
		<td align="left" valign=top>Artigo 22&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="124" align="left" valign=top>Toda persona, como miembro de la sociedad, tiene derecho a la seguridad social, y a obtener, mediante el esfuerzo nacional y la cooperaci&oacute;n internacional, habida cuenta de la organizaci&oacute;n y los recursos de cada Estado, la satisfacci&oacute;n de los derechos econ&oacute;micos, sociales y culturales, indispensables a su dignidad y al libre desarrollo de su personalidad.</td>
		<td align="left" valign=top>Everyone, as a member of society, has the right to social security and is entitled to realization, through national effort and international co-operation and in accordance with the organization and resources of each State, of the economic, social and cultural rights indispensable for his dignity and the free development of his personality.</td>
		<td align="left" valign=top>Toute personne, en tant que membre de la soci&eacute;t&eacute;, a droit &agrave; la s&eacute;curit&eacute; sociale; elle est fond&eacute;e &agrave; obtenir la satisfaction des droits &eacute;conomiques, sociaux et culturels indispensables &agrave; sa dignit&eacute; et au libre d&eacute;veloppement de sa personnalit&eacute;, gr&acirc;ce &agrave; l'effort national et &agrave; la coop&eacute;ration internationale, compte tenu de l'organisation et des ressources de chaque pays.</td>
		<td align="left" valign=top>Toda a pessoa, como membro da sociedade, tem direito &agrave; seguran&ccedil;a social; e pode legitimamente exigir a satisfa&ccedil;&atilde;o dos direitos econ&ocirc;micos, sociais e culturais indispens&aacute;veis, gra&ccedil;as ao esfor&ccedil;o nacional e &agrave; coopera&ccedil;&atilde;o internacional, de harmonia com a organiza&ccedil;&atilde;o e os recursos de cada pa&iacute;s.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 23</td>
		<td align="left" valign=top>Article 23</td>
		<td align="left" valign=top>Article 23</td>
		<td align="left" valign=top>Artigo 23&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Toda persona tiene derecho al trabajo, a la libre elecci&oacute;n de su trabajo, a condiciones equitativas y satisfactorias de trabajo y a la protecci&oacute;n contra el desempleo.</td>
		<td align="left" valign=top>Everyone has the right to work, to free choice of employment, to just and favourable conditions of work and to protection against unemployment.</td>
		<td align="left" valign=top>Toute personne a droit au travail, au libre choix de son travail, &agrave; des conditions &eacute;quitables et satisfaisantes de travail et &agrave; la protection contre le ch&ocirc;mage.</td>
		<td align="left" valign=top>Toda a pessoa tem direito ao trabalho, &agrave; livre escolha do trabalho, a condi&ccedil;&otilde;es equitativas e satisfat&oacute;rias de trabalho e &agrave; protec&ccedil;&atilde;o contra o desemprego.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Toda persona tiene derecho, sin discriminaci&oacute;n alguna, a igual salario por trabajo igual.</td>
		<td align="left" valign=top>Everyone, without any discrimination, has the right to equal pay for equal work.</td>
		<td align="left" valign=top>Tous ont droit, sans aucune discrimination, &agrave; un salaire &eacute;gal pour un travail &eacute;gal</td>
		<td align="left" valign=top>Todos t&ecirc;m direito, sem discrimina&ccedil;&atilde;o alguma, a sal&aacute;rio igual por trabalho igual.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="94" align="left" valign=top>Toda persona que trabaja tiene derecho a una remuneraci&oacute;n equitativa y satisfactoria, que le asegure, as&iacute; como a su familia, una existencia conforme a la dignidad humana y que ser&aacute; completada, en caso necesario, por cualesquiera otros medios de protecci&oacute;n social.</td>
		<td align="left" valign=top>Everyone who works has the right to just and favourable remuneration ensuring for himself and his family an existence worthy of human dignity, and supplemented, if necessary, by other means of social protection.</td>
		<td align="left" valign=top>Quiconque travaille a droit &agrave; une r&eacute;mun&eacute;ration &eacute;quitable et satisfaisante lui assurant ainsi qu'&agrave; sa famille une existence conforme &agrave; la dignit&eacute; humaine et compl&eacute;t&eacute;e, s'il y a lieu, par tous autres moyens de protection sociale.</td>
		<td align="left" valign=top>Quem trabalha tem direito a uma remunera&ccedil;&atilde;o equitativa e satisfat&oacute;ria, que lhe permita e &agrave; sua fam&iacute;lia uma exist&ecirc;ncia conforme com a dignidade humana, e completada, se poss&iacute;vel, por todos os outros meios de protec&ccedil;&atilde;o social.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Toda persona tiene derecho a fundar sindicatos y a sindicarse para la defensa de sus intereses.</td>
		<td align="left" valign=top>Everyone has the right to form and to join trade unions for the protection of his interests.</td>
		<td align="left" valign=top>Toute personne a le droit de fonder avec d'autres des syndicats et de s'affilier &agrave; des syndicats pour la d&eacute;fense de ses int&eacute;r&ecirc;ts.</td>
		<td align="left" valign=top>Toda a pessoa tem o direito de fundar com outras pessoas sindicatos e de se filiar em sindicatos para defesa dos seus interesses.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 24</td>
		<td align="left" valign=top>Article 24</td>
		<td align="left" valign=top>Article 24</td>
		<td align="left" valign=top>Artigo 24&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Toda persona tiene derecho al descanso, al disfrute del tiempo libre, a una limitaci&oacute;n razonable de la duraci&oacute;n del trabajo y a vacaciones peri&oacute;dicas pagadas.</td>
		<td align="left" valign=top>Everyone has the right to rest and leisure, including reasonable limitation of working hours and periodic holidays with pay.</td>
		<td align="left" valign=top>Toute personne a droit au repos et aux loisirs et notamment &agrave; une limitation raisonnable de la dur&eacute;e du travail et &agrave; des cong&eacute;s pay&eacute;s p&eacute;riodiques.</td>
		<td align="left" valign=top>Toda a pessoa tem direito ao repouso e aos lazeres, especialmente, a uma limita&ccedil;&atilde;o razo&aacute;vel da dura&ccedil;&atilde;o do trabalho e as f&eacute;rias peri&oacute;dicas pagas.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 25</td>
		<td align="left" valign=top>Article 25</td>
		<td align="left" valign=top>Article 25</td>
		<td align="left" valign=top>Artigo 25&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="139" align="left" valign=top>Toda persona tiene derecho a un nivel de vida adecuado que le asegure, as&iacute; como a su familia, la salud y el bienestar, y en especial la alimentaci&oacute;n, el vestido, la vivienda, la asistencia m&eacute;dica y los servicios sociales necesarios; tiene asimismo derecho a los seguros en caso de desempleo, enfermedad, invalidez, viudez, vejez y otros casos de p&eacute;rdida de sus medios de subsistencia por circunstancias independientes de su voluntad.</td>
		<td align="left" valign=top>Everyone has the right to a standard of living adequate for the health and well-being of himself and of his family, including food, clothing, housing and medical care and necessary social services, and the right to security in the event of unemployment, sickness, disability, widowhood, old age or other lack of livelihood in circumstances beyond his control.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; un niveau de vie suffisant pour assurer sa sant&eacute;, son bien-&ecirc;tre et ceux de sa famille, notamment pour l'alimentation, l'habillement, le logement, les soins m&eacute;dicaux ainsi que pour les services sociaux n&eacute;cessaires; elle a droit &agrave; la s&eacute;curit&eacute; en cas de ch&ocirc;mage, de maladie, d'invalidit&eacute;, de veuvage, de vieillesse ou dans les autres cas de perte de ses moyens de subsistance par suite de circonstances ind&eacute;pendantes de sa volont&eacute;.</td>
		<td align="left" valign=top>Toda a pessoa tem direito a um n&iacute;vel de vida suficiente para lhe assegurar e &agrave; sua fam&iacute;lia a sa&uacute;de e o bem-estar, principalmente quanto &agrave; alimenta&ccedil;&atilde;o, ao vestu&aacute;rio, ao alojamento, &agrave; assist&ecirc;ncia m&eacute;dica e ainda quanto aos servi&ccedil;os sociais necess&aacute;rios, e tem direito &agrave; seguran&ccedil;a no desemprego, na doen&ccedil;a, na invalidez, na viuvez, na velhice ou noutros casos de perda de meios de subsist&ecirc;ncia por circunst&acirc;ncias independentes da sua vontade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>La maternidad y la infancia tienen derecho a cuidados y asistencia especiales.</td>
		<td align="left" valign=top>Motherhood and childhood are entitled to special care and assistance.</td>
		<td align="left" valign=top>La maternit&eacute; et l'enfance ont droit &agrave; une aide et &agrave; une assistance sp&eacute;ciales.</td>
		<td align="left" valign=top>A maternidade e a inf&acirc;ncia t&ecirc;m direito a ajuda e a assist&ecirc;ncia especiais.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Todos los ni&ntilde;os, nacidos de matrimonio o fuera de matrimonio, tienen derecho a igual protecci&oacute;n social.</td>
		<td align="left" valign=top>All children, whether born in or out of wedlock, shall enjoy the same social protection.</td>
		<td align="left" valign=top>Tous les enfants, qu'ils soient n&eacute;s dans le mariage ou hors mariage, jouissent de la m&ecirc;me protection sociale.</td>
		<td align="left" valign=top>Todas as crian&ccedil;as, nascidas dentro ou fora do matrim&ocirc;nio, gozam da mesma protec&ccedil;&atilde;o social.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 26</td>
		<td align="left" valign=top>Article 26</td>
		<td align="left" valign=top>Article 26</td>
		<td align="left" valign=top>Artigo 26&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Toda persona tiene derecho a la educaci&oacute;n.</td>
		<td align="left" valign=top>Everyone has the right to education.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; l'&eacute;ducation.</td>
		<td align="left" valign=top>Toda a pessoa tem direito &agrave; educa&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>La educaci&oacute;n debe ser gratuita, al menos en lo concerniente a la instrucci&oacute;n elemental y fundamental.</td>
		<td align="left" valign=top>Education shall be free, at least in the elementary and fundamental stages.</td>
		<td align="left" valign=top>L'&eacute;ducation doit &ecirc;tre gratuite, au moins en ce qui concerne l'enseignement &eacute;l&eacute;mentaire et fondamental.</td>
		<td align="left" valign=top>A educa&ccedil;&atilde;o deve ser gratuita, pelo menos a correspondente ao ensino elementar fundamental.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>La instrucci&oacute;n elemental ser&aacute; obligatoria.</td>
		<td align="left" valign=top>Elementary education shall be compulsory.</td>
		<td align="left" valign=top>L'enseignement &eacute;l&eacute;mentaire est obligatoire.</td>
		<td align="left" valign=top>O ensino elementar &eacute; obrigat&oacute;rio.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>La instrucci&oacute;n t&eacute;cnica y profesional habr&aacute; de ser generalizada; el acceso a los estudios superiores ser&aacute; igual para todos, en funci&oacute;n de los m&eacute;ritos respectivos.</td>
		<td align="left" valign=top>Technical and professional education shall be made generally available and higher education shall be equally accessible to all on the basis of merit.</td>
		<td align="left" valign=top>L'enseignement technique et professionnel doit &ecirc;tre g&eacute;n&eacute;ralis&eacute;; l'acc&egrave;s aux &eacute;tudes sup&eacute;rieures doit &ecirc;tre ouvert en pleine &eacute;galit&eacute; &agrave; tous en fonction de leur m&eacute;rite.</td>
		<td align="left" valign=top>O ensino t&eacute;cnico e profissional dever ser generalizado; o acesso aos estudos superiores deve estar aberto a todos em plena igualdade, em fun&ccedil;&atilde;o do seu m&eacute;rito.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="124" align="left" valign=top>La educaci&oacute;n tendr&aacute; por objeto el pleno desarrollo de la personalidad humana y el fortalecimiento del respeto a los derechos humanos y a las libertades fundamentales; favorecer&aacute; la comprensi&oacute;n, la tolerancia y la amistad entre todas las naciones y todos los grupos &eacute;tnicos o religiosos; y promover&aacute; el desarrollo de las actividades de las Naciones Unidas para el mantenimiento de la paz.</td>
		<td align="left" valign=top>Education shall be directed to the full development of the human personality and to the strengthening of respect for human rights and fundamental freedoms. It shall promote understanding, tolerance and friendship among all nations, racial or religious groups, and shall further the activities of the United Nations for the maintenance of peace.</td>
		<td align="left" valign=top>L'&eacute;ducation doit viser au plein &eacute;panouissement de la personnalit&eacute; humaine et au renforcement du respect des droits de l'homme et des libert&eacute;s fondamentales. Elle doit favoriser la compr&eacute;hension, la tol&eacute;rance et l'amiti&eacute; entre toutes les nations et tous les groupes raciaux ou religieux, ainsi que le d&eacute;veloppement des activit&eacute;s des Nations Unies pour le maintien de la paix.</td>
		<td align="left" valign=top>A educa&ccedil;&atilde;o deve visar &agrave; plena expans&atilde;o da personalidade humana e ao refor&ccedil;o dos direitos do Homem e das liberdades fundamentais e deve favorecer a compreens&atilde;o, a toler&acirc;ncia e a amizade entre todas as na&ccedil;&otilde;es e todos os grupos raciais ou religiosos, bem como o desenvolvimento das actividades das Na&ccedil;&otilde;es Unidas para a manuten&ccedil;&atilde;o da paz.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="34" align="left" valign=top>Los padres tendr&aacute;n derecho preferente a escoger el tipo de educaci&oacute;n que habr&aacute; de darse a sus hijos.</td>
		<td align="left" valign=top>Parents have a prior right to choose the kind of education that shall be given to their children.</td>
		<td align="left" valign=top>Les parents ont, par priorit&eacute;, le droit de choisir le genre d'&eacute;ducation &agrave; donner &agrave; leurs enfants.</td>
		<td align="left" valign=top>Aos pais pertence a prioridade do direito de escholher o g&eacute;nero de educa&ccedil;&atilde;o a dar aos filhos.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 27</td>
		<td align="left" valign=top>Article 27</td>
		<td align="left" valign=top>Article 27</td>
		<td align="left" valign=top>Artigo 27&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Toda persona tiene derecho a tomar parte libremente en la vida cultural de la comunidad, a gozar de las artes y a participar en el progreso cient&iacute;fico y en los beneficios que de &eacute;l resulten.</td>
		<td align="left" valign=top>Everyone has the right freely to participate in the cultural life of the community, to enjoy the arts and to share in scientific advancement and its benefits.</td>
		<td align="left" valign=top>Toute personne a le droit de prendre part librement &agrave; la vie culturelle de la communaut&eacute;, de jouir des arts et de participer au progr&egrave;s scientifique et aux bienfaits qui en r&eacute;sultent</td>
		<td align="left" valign=top>Toda a pessoa tem o direito de tomar parte livremente na vida cultural da comunidade, de fruir as artes e de participar no progresso cient&iacute;fico e nos benef&iacute;cios que deste resultam.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Toda persona tiene derecho a la protecci&oacute;n de los intereses morales y materiales que le correspondan por raz&oacute;n de las producciones cient&iacute;ficas, literarias o art&iacute;sticas de que sea autora.</td>
		<td align="left" valign=top>Everyone has the right to the protection of the moral and material interests resulting from any scientific, literary or artistic production of which he is the author.</td>
		<td align="left" valign=top>Chacun a droit &agrave; la protection des int&eacute;r&ecirc;ts moraux et mat&eacute;riels d&eacute;coulant de toute production scientifique, litt&eacute;raire ou artistique dont il est l'auteur.</td>
		<td align="left" valign=top>Todos t&ecirc;m direito &agrave; protec&ccedil;&atilde;o dos interesses morais e materiais ligados a qualquer produ&ccedil;&atilde;o cient&iacute;fica, liter&aacute;ria ou art&iacute;stica da sua autoria.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 28</td>
		<td align="left" valign=top>Article 28</td>
		<td align="left" valign=top>Article 28</td>
		<td align="left" valign=top>Artigo 28&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="64" align="left" valign=top>Toda persona tiene derecho a que se establezca un orden social e internacional en el que los derechos y libertades proclamados en esta Declaraci&oacute;n se hagan plenamente efectivos.</td>
		<td align="left" valign=top>Everyone is entitled to a social and international order in which the rights and freedoms set forth in this Declaration can be fully realized.</td>
		<td align="left" valign=top>Toute personne a droit &agrave; ce que r&egrave;gne, sur le plan social et sur le plan international, un ordre tel que les droits et libert&eacute;s &eacute;nonc&eacute;s dans la pr&eacute;sente D&eacute;claration puissent y trouver plein effet.</td>
		<td align="left" valign=top>Toda a pessoa tem direito a que reine, no plano social e no plano internacional, uma ordem capaz de tornar plenamente efectivos os direitos e as liberdades enunciadas na presente Declara&ccedil;&atilde;o.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 29</td>
		<td align="left" valign=top>Article 29</td>
		<td align="left" valign=top>Article 29</td>
		<td align="left" valign=top>Artigo 29&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Toda persona tiene deberes respecto a la comunidad, puesto que s&oacute;lo en ella puede desarrollar libre y plenamente su personalidad.</td>
		<td align="left" valign=top>Everyone has duties to the community in which alone the free and full development of his personality is possible.</td>
		<td align="left" valign=top>L'individu a des devoirs envers la communaut&eacute; dans laquelle seule le libre et plein d&eacute;veloppement de sa personnalit&eacute; est possible.</td>
		<td align="left" valign=top>O indiv&iacute;duo tem deveres para com a comunidade, fora da qual n&atilde;o &eacute; poss&iacute;vel o livre e pleno desenvolvimento da sua personalidade.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="124" align="left" valign=top>En el ejercicio de sus derechos y en el disfrute de sus libertades, toda persona estar&aacute; solamente sujeta a las limitaciones establecidas por la ley con el &uacute;nico fin de asegurar el reconocimiento y el respeto de los derechos y libertades de los dem&aacute;s, y de satisfacer las justas exigencias de la moral, del orden p&uacute;blico y del bienestar general en una sociedad democr&aacute;tica.</td>
		<td align="left" valign=top>In the exercise of his rights and freedoms, everyone shall be subject only to such limitations as are determined by law solely for the purpose of securing due recognition and respect for the rights and freedoms of others and of meeting the just requirements of morality, public order and the general welfare in a democratic society.</td>
		<td align="left" valign=top>Dans l'exercice de ses droits et dans la jouissance de ses libert&eacute;s, chacun n'est soumis qu'aux limitations &eacute;tablies par la loi exclusivement en vue d'assurer la reconnaissance et le respect des droits et libert&eacute;s d'autrui et afin de satisfaire aux justes exigences de la morale, de l'ordre public et du bien-&ecirc;tre g&eacute;n&eacute;ral dans une soci&eacute;t&eacute; d&eacute;mocratique.</td>
		<td align="left" valign=top>No exerc&iacute;cio deste direito e no gozo destas liberdades ningu&eacute;m est&aacute; sujeito sen&atilde;o &agrave;s limita&ccedil;&otilde;es estabelecidas pela lei com vista exclusivamente a promover o reconhecimento e o respeito dos direitos e liberdades dos outros e a fim de satisfazer as justas exig&ecirc;ncias da moral, da ordem p&uacute;blica e do bem-estar numa sociedade democr&aacute;tica.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="49" align="left" valign=top>Estos derechos y libertades no podr&aacute;n en ning&uacute;n caso ser ejercidos en oposici&oacute;n a los prop&oacute;sitos y principios de las Naciones Unidas.</td>
		<td align="left" valign=top>These rights and freedoms may in no case be exercised contrary to the purposes and principles of the United Nations.</td>
		<td align="left" valign=top>Ces droits et libert&eacute;s ne pourront, en aucun cas, s'exercer contrairement aux buts et aux principes des Nations Unies.</td>
		<td align="left" valign=top>Em caso algum estes direitos e liberdades poder&atilde;o ser exercidos contrariamente e aos fins e aos princ&iacute;pios das Na&ccedil;&otilde;es Unidas.</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="20" align="left" valign=top>Art&iacute;culo 30</td>
		<td align="left" valign=top>Article 30</td>
		<td align="left" valign=top>Article 30</td>
		<td align="left" valign=top>Artigo 30&deg;</td>
		<td align="left">DDHH_es</td>
	</tr>
	<tr>
		<td height="94" align="left" valign=top>Nada en la presente Declaraci&oacute;n podr&aacute; interpretarse en el sentido de que confiere derecho alguno al Estado, a un grupo o a una persona, para emprender y desarrollar actividades o realizar actos tendientes a la supresi&oacute;n de cualquiera de los derechos y libertades proclamados en esta Declaraci&oacute;n.</td>
		<td align="left" valign=top>Nothing in this Declaration may be interpreted as implying for any State, group or person any right to engage in any activity or to perform any act aimed at the destruction of any of the rights and freedoms set forth herein.</td>
		<td align="left" valign=top>Aucune disposition de la pr&eacute;sente D&eacute;claration ne peut &ecirc;tre interpr&eacute;t&eacute;e comme impliquant, pour un Etat, un groupement ou un individu, un droit quelconque de se livrer &agrave; une activit&eacute; ou d'accomplir un acte visant &agrave; la destruction des droits et libert&eacute;s qui y sont &eacute;nonc&eacute;s.</td>
		<td align="left" valign=top>Nenhuma disposi&ccedil;&atilde;o da presente Declara&ccedil;&atilde;o pode ser interpretada de maneira a envolver para qualquer Estado, agrupamento ou indiv&iacute;duo o direito de se entregar a alguma actividade ou de praticar algum acto destinado a destruir os direitos e liberdades aqui enunciados.</td>
		<td align="left">DDHH_es</td>
	</tr>
</table>
<!-- ************************************************************************** -->
</body>

</html>
